In [1]:
import pandas as pd 
import numpy as np 
import seaborn as sns
import sklearn 
from sklearn.preprocessing import MinMaxScaler,StandardScaler,OneHotEncoder,OrdinalEncoder
from sklearn.impute import SimpleImputer

In [4]:
df=pd.read_csv('dataSets/dataset/a.csv',encoding='latin-1',na_values=['?? ???? ????????','???? ??? ????? ????? ??? ???????' , '??????? ?? ???? ??????','?????','????','???'])
ds=pd.read_csv('dataSets/dataset/a.csv',encoding='latin-1')

In [108]:
df.head()

,Order Number,Order Status,Book Name,Order Date,City (Billing)
0,70978,Completed,Column Nigari Kese Sekhain,1/20/2021 17:43,Swat
1,70962,Completed,NaN,1/20/2021 13:37,Karachi
2,70960,Completed,Justju ka safar-1/Waqfa e Pareshani,1/20/2021 10:48,Karachi
3,70959,Completed,R ka Taaruf,1/20/2021 10:32,Karachi
4,70958,Completed,NaN,1/20/2021 10:29,Karachi

In [4]:
df.shape

(19187, 5)

In [99]:
df.isnull().sum()

Order Number         0
Order Status         0
Book Name         2578
Order Date           0
City (Billing)      73
dtype: int64

In [6]:
df['Book Name'].nunique()

3464

In [7]:
df['Order Status'].value_counts()

Completed    17896
Returned      1263
Canceled        28
Name: Order Status, dtype: int64

In [230]:
df.columns

Index(['Order Number', 'Order Status', 'Book Name', 'Order Date',
       'City (Billing)'],
      dtype='object')

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19187 entries, 0 to 19186
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Order Number    19187 non-null  int64
 1   Order Status    19187 non-null  object
 2   Book Name       16609 non-null  object
 3   Order Date      19187 non-null  object
 4   City (Billing)  19114 non-null  object
dtypes: int64(1), object(4)
memory usage: 749.6+ KB

In [ ]:
def pre():
    df['Order Date']=pd.to_datetime(df['Order Date'])
    si=SimpleImputer(strategy='most_frequent')
    df['City (Billing)']=si.fit_transform(df[['City (Billing)']])

In [109]:
df['Order Date']=pd.to_datetime(df['Order Date'])

In [112]:
df.head()

,Order Number,Order Status,Book Name,Order Date,City (Billing)
0,70978,Completed,Column Nigari Kese Sekhain,2021-01-20 17:43:00,Swat
1,70962,Completed,NaN,2021-01-20 13:37:00,Karachi
2,70960,Completed,Justju ka safar-1/Waqfa e Pareshani,2021-01-20 10:48:00,Karachi
3,70959,Completed,R ka Taaruf,2021-01-20 10:32:00,Karachi
4,70958,Completed,NaN,2021-01-20 10:29:00,Karachi

In [113]:
df.isnull().sum()

Order Number         0
Order Status         0
Book Name         2578
Order Date           0
City (Billing)       0
dtype: int64

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19187 entries, 0 to 19186
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Order Number    19187 non-null  int64
 1   Order Status    19187 non-null  object
 2   Book Name       16609 non-null  object
 3   Order Date      19187 non-null  datetime64[ns]
 4   City (Billing)  19114 non-null  object
dtypes: datetime64[ns](1), int64(1), object(3)
memory usage: 749.6+ KB

In [96]:
df['year']= df['Order Date'].dt.year
df['month']= df['Order Date'].dt.month_name()
df['day']= df['Order Date'].dt.day_name()

In [114]:
df.head()

,Order Number,Order Status,Book Name,Order Date,City (Billing)
0,70978,Completed,Column Nigari Kese Sekhain,2021-01-20 17:43:00,Swat
1,70962,Completed,NaN,2021-01-20 13:37:00,Karachi
2,70960,Completed,Justju ka safar-1/Waqfa e Pareshani,2021-01-20 10:48:00,Karachi
3,70959,Completed,R ka Taaruf,2021-01-20 10:32:00,Karachi
4,70958,Completed,NaN,2021-01-20 10:29:00,Karachi

In [235]:
df['City (Billing)'].value_counts()

Karachi                                                                   2319
Lahore                                                                    1988
Islamabad                                                                  859
Rawalpindi                                                                 644
Faisalabad                                                                 476
                                                                          ...
Dadyal Ajk                                                                   1
Shah latif town Karachi                                                      1
Mirpur Azad kashmir                                                          1
ALI town lahore thokar niaz biag near university of lahore old campus.       1
Karachi                                                                      1
Name: City (Billing), Length: 4077, dtype: int64

In [236]:
((df['City (Billing)'].value_counts() ) <= 210).value_counts()

True     4066
False      11
Name: City (Billing), dtype: int64

In [25]:
df['City (Billing)'].nunique()

4077

In [40]:
df['City (Billing)']

0              Swat
1           Karachi
2           Karachi
3           Karachi
4           Karachi
            ...
19182      Karachi
19183    Rawalpindi
19184     Hyderabad
19185    Rawalpindi
19186    faisalabad
Name: City (Billing), Length: 19187, dtype: object

In [26]:
df.isnull().sum()

Order Number         0
Order Status         0
Book Name         2578
Order Date           0
City (Billing)      73
year                 0
month                0
day                  0
dtype: int64

In [39]:
df['City (Billing)'][1]

'Karachi'

In [115]:

def myfun():
    count= df['City (Billing)'].value_counts()
    ci=count[ count > 168 ].index
    j=0
    for i in df['City (Billing)']:
        if i in ci:
            pass
        else:
            df['City (Billing)'][j]="others"
    
        j=j+1

In [116]:
myfun()

C:\Users\ALI HASNAIN\AppData\Local\Temp\ipykernel_14624\172603650.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['City (Billing)'][j]="others"

In [90]:
df.head()

,Order Number,Order Status,Book Name,Order Date,City (Billing)
0,70978,Completed,Column Nigari Kese Sekhain,1/20/2021 17:43,SimpleImputer(strategy='most_frequent')
1,70962,Completed,NaN,1/20/2021 13:37,SimpleImputer(strategy='most_frequent')
2,70960,Completed,Justju ka safar-1/Waqfa e Pareshani,1/20/2021 10:48,SimpleImputer(strategy='most_frequent')
3,70959,Completed,R ka Taaruf,1/20/2021 10:32,SimpleImputer(strategy='most_frequent')
4,70958,Completed,NaN,1/20/2021 10:29,SimpleImputer(strategy='most_frequent')

In [61]:
df['City (Billing)'].value_counts()

others        10873
Karachi        2319
Lahore         1988
Islamabad       859
Rawalpindi      644
Faisalabad      476
Peshawar        427
Multan          424
Gujranwala      262
karachi         251
Hyderabad       240
Quetta          223
Sialkot         201
Name: City (Billing), dtype: int64

In [54]:
count= df['City (Billing)'].value_counts()
count[ count > 168 ].index

Index(['Karachi', 'Lahore', 'Islamabad', 'Rawalpindi', 'Faisalabad',
       'Peshawar', 'Multan', 'Gujranwala', 'karachi', 'Hyderabad', 'Quetta',
       'Sialkot'],
      dtype='object')

In [241]:
l_50=count[ count <= 50 ].index
#1-50

In [242]:
g_50=count[ count > 50 ] 
#51<

In [243]:

b_50_124=g_50[g_50 <= 124].index
#51-123

In [261]:
g_124=count[ count > 124 ].index
g_124

Index(['Karachi', 'Lahore', 'Islamabad', 'Rawalpindi', 'Faisalabad',
       'Peshawar', 'Multan', 'Gujranwala', 'karachi', 'Hyderabad', 'Quetta',
       'Sialkot', 'Bahawalpur'],
      dtype='object')

In [265]:
df_l_50=pd.get_dummies(df['City (Billing)'].replace(l_50,"till_50"))

In [266]:
df_50_124=pd.get_dummies(df['City (Billing)'].replace(b_50_124,"bet_51_124"))

In [269]:
df_124_g=pd.get_dummies(df['City (Billing)'].replace(g_124,"greater_124"))

In [279]:
df_bin=pd.get_dummies(df['City (Billing)'].replace((count[ count < 124 ].index) ,"others"))

In [326]:
def myfuc(count):
    if count < 124 :
        return 'others'

In [252]:
df['City (Billing)'].nunique()

4077

In [69]:
from sklearn.preprocessing import MinMaxScaler,StandardScaler,OneHotEncoder,OrdinalEncoder
from sklearn.compose import ColumnTransformer,make_column_transformer
from sklearn.impute import SimpleImputer
from sklearn.pipeline import Pipeline,make_pipeline
from sklearn.feature_selection import SelectKBest,chi2

In [70]:
tr1=make_column_transformer(myfun(),remainder='passthrough')

C:\Users\ALI HASNAIN\AppData\Local\Temp\ipykernel_14624\172603650.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['City (Billing)'][j]="others"

TypeError: 'NoneType' object is not iterable

In [8]:
ds['Order Number'].isnull().sum()

0